# Data Preprocessing: Combine/Merge Dataframes

## Import Modules

In [1]:
import pandas as pd

## Prepare Data

In [2]:
data1 = {
    "id": [1, 2, 3, 4],
    "Names": ["Peter", "Paul", "Mary", "Linda"],
}
df1 = pd.DataFrame(data1)
df1

   id  Names
0   1  Peter
1   2   Paul
2   3   Mary
3   4  Linda

In [3]:
data2 = {
    "id": [1, 2, 3, 4],
    "Day of Birth": ["1970-01-12", "1983-05-05", "2000-03-17", "1997-10-13"],
    "Children": [0, 2, 1, 5]
}
df2 = pd.DataFrame(data2)
df2

   id Day of Birth  Children
0   1   1970-01-12         0
1   2   1983-05-05         2
2   3   2000-03-17         1
3   4   1997-10-13         5

## Combine/Merge Dataframes

In [4]:
df_all = pd.merge(df1, df2, on="id")
df_all

   id  Names Day of Birth  Children
0   1  Peter   1970-01-12         0
1   2   Paul   1983-05-05         2
2   3   Mary   2000-03-17         1
3   4  Linda   1997-10-13         5